### 4. 데이터프레임 데이터 조작

In [54]:
import numpy as np
import pandas as pd

- 데이터 갯수 세기

In [55]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

TypeError: 'int' object is not callable

In [ ]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [ ]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [ ]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

- 연습문제 4.4.1

In [ ]:
# 타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

- 카테고리 값 세기

In [ ]:
# 열 별로 인덱싱해서 세기
titanic['class'].value_counts()

class
Third     491
First     216
Second    184
Name: count, dtype: int64

In [ ]:
titanic['embark_town'].value_counts()

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

- 정렬

In [ ]:
np.random.seed = 2023
df = pd.DataFrame(np.random.randint(40, 101, size=(4, 5)), index=list('abcd'), columns=list('VWXYZ'))
df['V']['c'] = df['V']['b']
df

    V   W    X   Y   Z
a  83  91   79  78  82
b  73  98  100  43  45
c  73  44   86  46  71
d  59  97   71  42  56

In [ ]:
df.sort_values(by='V')

    V   W    X   Y   Z
d  59  97   71  42  56
b  73  98  100  43  45
c  73  44   86  46  71
a  83  91   79  78  82

In [ ]:
# V열에 동일한 값이 있으면, 동일한 값은 W열을 보고 정렬
df2 = df.sort_values(by=['V', 'W'])
df2

    V   W    X   Y   Z
d  59  97   71  42  56
c  73  44   86  46  71
b  73  98  100  43  45
a  83  91   79  78  82

In [ ]:
df2.sort_index()

    V   W    X   Y   Z
a  83  91   79  78  82
b  73  98  100  43  45
c  73  44   86  46  71
d  59  97   71  42  56

- 연습문제 4.4.2
    - sort_values 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수,
    - 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

In [ ]:
print(titanic.value_counts('sex'))
print(titanic.value_counts('class'))
print(titanic.value_counts('alive'))

sex
male      577
female    314
Name: count, dtype: int64
class
Third     491
First     216
Second    184
Name: count, dtype: int64
alive
no     549
yes    342
Name: count, dtype: int64

- 행/열 합계

In [ ]:
df

    V   W    X   Y   Z
a  83  91   79  78  82
b  73  98  100  43  45
c  73  44   86  46  71
d  59  97   71  42  56

In [ ]:
# 행 방향(열의 합계)
df.sum(axis=0)

V    288
W    330
X    336
Y    209
Z    254
dtype: int64

In [ ]:
# 열 방향(행의 합계)
df.sum(axis=1)

a    413
b    359
c    320
d    325
dtype: int64

In [ ]:
# 총점 열
df['총점'] = df.sum(axis=1)
df

    V   W    X   Y   Z   총점
a  83  91   79  78  82  413
b  73  98  100  43  45  359
c  73  44   86  46  71  320
d  59  97   71  42  56  325

In [ ]:
# 평균
df['평균'] = df.iloc[:, :5].mean(axis=1)
df

    V   W    X   Y   Z   총점    평균
a  83  91   79  78  82  413  82.6
b  73  98  100  43  45  359  71.8
c  73  44   86  46  71  320  64.0
d  59  97   71  42  56  325  65.0

In [ ]:
# 행 추가 방법
df.loc['합계', :] = df.sum()
df

        V      W      X      Y      Z      총점     평균
a    83.0   91.0   79.0   78.0   82.0   413.0   82.6
b    73.0   98.0  100.0   43.0   45.0   359.0   71.8
c    73.0   44.0   86.0   46.0   71.0   320.0   64.0
d    59.0   97.0   71.0   42.0   56.0   325.0   65.0
합계  288.0  330.0  336.0  209.0  254.0  1417.0  283.4

- 연습 문제 4.4.3
    - 타이타닉호 승객의 평균 나이를 구하라.
    - 타이타닉호 승객중 여성 승객의 평균 나이를 구하라.
    - 타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.

In [ ]:
titanic['age'].sum(axis=0) / titanic['age'].count()

29.69911764705882

In [ ]:
a = titanic['sex'] == 'female'
(titanic.age[a]).mean().round(2)

27.92

In [ ]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
b = titanic['class'] == 'First'
(titanic.age[a * b]).mean().round(2)

34.61

- apply 변환

In [ ]:
df2

    V   W    X   Y   Z
d  59  97   71  42  56
c  73  44   86  46  71
b  73  98  100  43  45
a  83  91   79  78  82

In [ ]:
# 각 열에서 최댓값 - 최솟값 연산 결과
df2.apply(lambda x :x.max() - x.min())      # 람다 함수의 x는 각 컬럼을 의미

V    24
W    54
X    29
Y    36
Z    37
dtype: int32

In [ ]:
# V열인덱싱에 제곱 값 대치
df2['V'].apply(lambda x: x**2)              # x는 V열의 원소를 의미

d    3481
c    5329
b    5329
a    6889
Name: V, dtype: int64

In [ ]:
# 타이타닉호의 승객 중 나이 20살을 기준으로 성인(adult)과 미성년자(child)를 구별하는 라벨 열 만들기
titanic['adult/child'] = titanic.age.apply(lambda x: 'adult' if x > 20 else 'child')
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

In [ ]:
data = {
    'price' : ['1,200', '2,500', '3,300'],
    'text' : ['03.입출력.ipynb', '04.고급인덱싱.ipynb', '05.데이터조작.ipynb']
    }
df3 = pd.DataFrame(data)
df3

   price            text
0  1,200    03.입출력.ipynb
1  2,500  04.고급인덱싱.ipynb
2  3,300  05.데이터조작.ipynb

In [ ]:
df3['정수'] = df3.price.apply(lambda x: int(x.replace(',', '')))
df3

   price            text    정수
0  1,200    03.입출력.ipynb  1200
1  2,500  04.고급인덱싱.ipynb  2500
2  3,300  05.데이터조작.ipynb  3300

In [ ]:
import string, re
df3['구둣점제거'] = df3.text.apply(lambda x: x.replace('.', ''))
df3

   price            text    정수         구둣점제거
0  1,200    03.입출력.ipynb  1200    03입출력ipynb
1  2,500  04.고급인덱싱.ipynb  2500  04고급인덱싱ipynb
2  3,300  05.데이터조작.ipynb  3300  05데이터조작ipynb

In [ ]:
df3['한글제거'] = df3.text.replace('[ㄱ-ㅎㅏ-ㅣ가-힣]','',regex=True)
df3

   price            text    정수         구둣점제거       한글제거
0  1,200    03.입출력.ipynb  1200    03입출력ipynb  03..ipynb
1  2,500  04.고급인덱싱.ipynb  2500  04고급인덱싱ipynb  04..ipynb
2  3,300  05.데이터조작.ipynb  3300  05데이터조작ipynb  05..ipynb

- 연습문제 4.4.4
    - 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만들어라. category1 카테고리는 다음과 같이 정의된다.
    - 20살이 넘으면 성별을 그대로 사용한다.
    - 20살 미만이면 성별에 관계없이 “child”라고 한다.

In [ ]:
titanic['category1'] = titanic.apply(lambda x : x.sex if x.age > 20 else 'child', axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult,male

In [ ]:
# by for loop
category2 = []
for i in titanic.index:
    if titanic.age[i] > 20:
        category2.append(titanic.sex[i])
    else:
        category2.append('child')
category2

['male',
 'female',
 'female',
 'female',
 'male',
 'child',
 'male',
 'child',
 'female',
 'child',
 'child',
 'female',
 'child',
 'male',
 'child',
 'female',
 'child',
 'child',
 'female',
 'child',
 'male',
 'male',
 'child',
 'male',
 'child',
 'female',
 'child',
 'child',
 'child',
 'child',
 'male',
 'child',
 'child',
 'male',
 'male',
 'male',
 'child',
 'male',
 'child',
 'child',
 'female',
 'female',
 'child',
 'child',
 'child',
 'child',
 'child',
 'child',
 'child',
 'child',
 'child',
 'male',
 'female',
 'female',
 'male',
 'child',
 'female',
 'male',
 'child',
 'child',
 'male',
 'female',
 'male',
 'child',
 'child',
 'child',
 'female',
 'child',
 'child',
 'male',
 'male',
 'child',
 'male',
 'male',
 'male',
 'male',
 'child',
 'child',
 'child',
 'female',
 'male',
 'male',
 'child',
 'male',
 'child',
 'female',
 'child',
 'child',
 'female',
 'male',
 'male',
 'child',
 'male',
 'male',
 'male',
 'child',
 'male',
 'male',
 'female',
 'male',
 'female',
 'child',
 'male',
 'male',
 'male',
 'male',
 'female',
 'child',
 'male',
 'child',
 'male',
 'child',
 'male',
 'child',
 'child',
 'male',
 'male',
 'male',
 'male',
 'child',
 'male',
 'child',
 'male',
 'female',
 'male',
 'child',
 'child',
 'male',
 'child',
 'male',
 'male',
 'child',
 'female',
 'female',
 'male',
 'male',
 'child',
 'male',
 'child',
 'male',
 'child',
 'female',
 'female',
 'child',
 'child',
 'child',
 'male',
 'child',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'child',
 'male',
 'child',
 'male',
 'child',
 'child',
 'male',
 'female',
 'male',
 'child',
 'child',
 'child',
 'child',
 'female',
 'child',
 'male',
 'male',
 'child',
 'child',
 'male',
 'male',
 'child',
 'child',
 'female',
 'male',
 'male',
 'child',
 'child',
 'child',
 'child',
 'child',
 'child',
 'child',
 'male',
 'male',
 'male',
 'female',
 'child',
 'child',
 'child',
 'female',
 'female',
 'child',
 'male',
 'child',
 'female',
 'male',
 'child',
 'male',
 'male',
 'child',
 'child',
 'male',
 'male',
 'child',
 'male',
 'male',
 'female',
 'male',
 'male',
 'child',
 'female',
 'female',
 'male',
 'female',
 'male',
 'child',
 'male',
 'male',
 'child',
 'male',
 'male',
 'child',
 'male',
 'child',
 'child',
 'female',
 'male',
 'male',
 'child',
 'male',
 'child',
 'male',
 'child',
 'child',
 'male',
 'child',
 'child',
 'male',
 'male',
 'male',
 'male',
 'female',
 'female',
 'male',
 'male',
 'child',
 'female',
 'male',
 'male',
 'female',
 'female',
 'child',
 'female',
 'female',
 'female',
 'child',
 'child',
 'male',
 'male',
 'child',
 'male',
 'child',
 'male',
 'female',
 'female',
 'child',
 'male',
 'female',
 'male',
 'child',
 'female',
 'female',
 'child',
 'child',
 'female',
 'male',
 'male',
 'child',
 'child',
 'child',
 'male',
 'male',
 'male',
 'male',
 'female',
 'female',
 'child',
 'male',
 'female',
 'male',
 'child',
 'male',
 'child',
 'child',
 'female',
 'child',
 'child',
 'child',
 'child',
 'child',
 'child',
 'child',
 'child',
 'male',
 'female',
 'female',
 'child',
 'female',
 'male',
 'male',
 'female',
 'female',
 'male',
 'female',
 'female',
 'male',
 'male',
 'female',
 'female',
 'child',
 'female',
 'male',
 'female',
 'female',
 'child',
 'child',
 'male',
 'male',
 'child',
 'child',
 'child',
 'male',
 'female',
 'male',
 'male',
 'child',
 'female',
 'male',
 'male',
 'male',
 'female',
 'female',
 'child',
 'child',
 'male',
 'male',
 'child',
 'child',
 'male',
 'child',
 'male',
 'female',
 'female',
 'child',
 'child',
 'male',
 'male',
 'female',
 'male',
 'child',
 'male',
 'female',
 'child',
 'child',
 'female',
 'male',
 'child',
 'child',
 'male',
 'child',
 'child',
 'female',
 'male',
 'child',
 'child',
 'female',
 'child',
 'male',
 'female',
 'child',
 'child',
 'child',
 'female',
 'child',
 'child',
 'male',
 'male',
 'male',
 'female',
 'female',
 'male',
 'female',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'male',
 'child',
 'male',
 'male',
 'child',
 'male',
 'child',
 'child',
 'child',
 'female',
 'child',
 'male',
 'child',
 'female',
 'child',
 'male',
 'child',
 'child',
 'male',
 'male',
 'female',
 'child',
 'child',
 'female',
 'child',
 'child',
 'male',
 'male',
 'child',
 'female',
 'child',
 'male',
 'child',
 'female',
 'female',
 'male',
 'male',
 'female',
 'child',
 'male',
 'female',
 'child',
 'child',
 'child',
 'male',
 'child',
 'male',
 'male',
 'child',
 'male',
 'male',
 'child',
 'male',
 'male',
 'child',
 'female',
 'child',
 'male',
 'male',
 'male',
 'male',
 'child',
 'male',
 'child',
 'male',
 'child',
 'child',
 'child',
 'male',
 'female',
 'female',
 'female',
 'child',
 'male',
 'male',
 'male',
 'child',
 'child',
 'child',
 'male',
 'female',
 'male',
 'child',
 'female',
 'male',
 'male',
 'child',
 'child',
 'male',
 'male',
 'male',
 'male',
 'child',
 'female',
 'child',
 'female',
 'male',
 'child',
 'female',
 'child',
 'female',
 'child',
 'child',
 'female',
 'child',
 'male',
 'male',
 'male',
 'child',
 'male',
 'female',
 'male',
 'male',
 'female',
 'child',
 'female',
 'male',
 'female',
 'male',
 'child',
 'female',
 'child',
 'male',
 'female',
 'child',
 'male',
 'male',
 'child',
 'child',
 'child',
 'child',
 'female',
 'child',
 'male',
 'female',
 'child',
 'female',
 'female',
 'child',
 'child',
 'male',
 'male',
 'male',
 'child',
 'child',
 'male',
 'child',
 'child',
 'male',
 'child',
 'male',
 'female',
 'male',
 'female',
 'child',
 'female',
 'female',
 'child',
 'male',
 'male',
 'child',
 'child',
 'male',
 'child',
 'female',
 'child',
 'male',
 'male',
 'female',
 'male',
 'child',
 'child',
 'child',
 'female',
 'female',
 'child',
 'male',
 'female',
 'female',
 'male',
 'male',
 'child',
 'child',
 'male',
 'male',
 'male',
 'child',
 'male',
 'female',
 'male',
 'child',
 'male',
 'male',
 'child',
 'male',
 'child',
 'male',
 'female',
 'child',
 'child',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'female',
 'female',
 'child',
 'child',
 'child',
 'male',
 'female',
 'male',
 'female',
 'child',
 'male',
 'male',
 'male',
 'child',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'child',
 'male',
 'male',
 'male',
 'child',
 'child',
 'female',
 'male',
 'male',
 'female',
 'child',
 'child',
 'female',
 'child',
 'child',
 'child',
 'male',
 'child',
 'male',
 'child',
 'female',
 'child',
 'child',
 'male',
 'child',
 'child',
 'male',
 'child',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'child',
 'male',
 'male',
 'child',
 'male',
 'child',
 'female',
 'male',
 'male',
 'male',
 'child',
 'child',
 'male',
 'child',
 'female',
 'male',
 'child',
 'male',
 'child',
 'child',
 'male',
 'male',
 'child',
 'child',
 'child',
 'child',
 'male',
 'child',
 'child',
 'male',
 'male',
 'male',
 'male',
 'child',
 'male',
 'male',
 'child',
 'male',
 'child',
 'male',
 'male',
 'male',
 'female',
 'male',
 'female',
 'child',
 'female',
 'child',
 'male',
 'male',
 'male',
 'child',
 'female',
 'female',
 'child',
 'male',
 'child',
 'child',
 'male',
 'male',
 'male',
 'child',
 'female',
 'child',
 'male',
 'female',
 'female',
 'child',
 'child',
 'male',
 'male',
 'male',
 'female',
 'male',
 'child',
 'child',
 'child',
 'male',
 'female',
 'male',
 'male',
 'male',
 'child',
 'female',
 'child',
 'male',
 'child',
 'child',
 'male',
 'male',
 'female',
 'child',
 'male',
 'child',
 'male',
 'female',
 'child',
 'male',
 'child',
 'female',
 'child',
 'female',
 'child',
 'female',
 'child',
 'male',
 'male',
 'male',
 'female',
 'child',
 'female',
 'child',
 'child',
 'child',
 'child',
 'female',
 'child',
 'child',
 'male',
 'child',
 'male',
 'male',
 'child',
 'child',
 'child',
 'male',
 'child',
 'child',
 'child',
 'child',
 'male',
 'male',
 'female',
 'female',
 'male',
 'female',
 'male',
 'female',
 'child',
 'child',
 'male',
 'male',
 'male',
 'child',
 'male',
 'female',
 'male',
 'male',
 'male',
 'child',
 'male',
 'child',
 'female',
 'male',
 'male',
 'child',
 'female',
 'male',
 'male',
 'female',
 'child',
 'child',
 'child',
 'child',
 'child',
 'female',
 'child',
 'child',
 'child',
 'male',
 'child',
 'female',
 'male',
 'child',
 'male',
 'child',
 'child',
 'child',
 'female',
 'male',
 'child',
 'male',
 'child',
 'male',
 'male',
 'child',
 'child',
 'male',
 'child',
 'child',
 'female',
 'child',
 'female',
 'male',
 'female',
 'child',
 'male',
 'male',
 'female',
 'child',
 'male',
 'female',
 'female',
 'male',
 'child',
 'child',
 'male',
 'female',
 'male',
 'male',
 'female',
 'child',
 'child',
 'child',
 'child',
 'female',
 'female',
 'male',
 'female',
 'male',
 'male',
 'female',
 'male',
 'child',
 'child',
 'male',
 'male']

- 결측치 처리

In [ ]:
dt = sns.load_dataset('titanic')
dt.shape

(891, 15)

In [56]:
# 어떤열에 결측치 있는지 확인
dt.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [ ]:
# 전체에서 결측치가 있는지 확인
dt.isna().sum().sum()

869

In [57]:
# deck는 결측치가 too much -> 열 삭제
# del dt['deck]
dt.drop(columns=['deck'], inplace=True)
dt.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True

In [58]:
# age 결측치는 평균으로 대체
dt.age.fillna(dt.age.mean().round(2), inplace=True)
dt.tail(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
881,0,3,male,33.0,0,0,7.8958,S,Third,man,True,Southampton,no,True
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,Southampton,no,True
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,Queenstown,no,False
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,Southampton,yes,True
888,0,3,female,29.7,1,2,23.4500,S,Third,woman,False,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,Queenstown,no,True

In [59]:
dt.embarked.value_counts()

embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [60]:
# embarked 결측치는 최빈값으로 대체

dt.embarked.fillna('S', inplace=True)
dt['embarked'].value_counts()

embarked
S    646
C    168
Q     77
Name: count, dtype: int64

In [62]:
# embark_town 결측치는 행 삭제
dt.dropna(subset=['embark_town'], inplace=True)
dt.isna().sum().sum()

0

In [63]:
dt.shape

(889, 14)

- astype

In [65]:
data = {
    'price1' : ['1200', '24000', '3600'],
    'price2' : ['1,200', '24,000', '3,600']
}
df4 = pd.DataFrame(data)
df4

  price1  price2
0   1200   1,200
1  24000  24,000
2   3600   3,600

In [67]:
type(df4.price1[0]), type(df4.price2[0])

(str, str)

In [68]:
df4['int1'] = df4.price1.astype(int)
df4

  price1  price2   int1
0   1200   1,200   1200
1  24000  24,000  24000
2   3600   3,600   3600

In [69]:
type(df4.int1[0])

numpy.int32

In [70]:
df4['int2'] = df4.price2.apply(lambda x: int(x.replace(',', '')))
df4

  price1  price2   int1   int2
0   1200   1,200   1200   1200
1  24000  24,000  24000  24000
2   3600   3,600   3600   3600

In [72]:
df4['int3'] = df4.price2.str.replace(',', '').astype(int)
type(df4.int1[0]), type(df4.int2[0]), type(df4.int3[0])

(numpy.int32, numpy.int64, numpy.int32)

- 실수 값을 카테고리 값으로 변환

In [73]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]

In [74]:
bins = [1, 20, 30, 50, 70, 100]         # 1 < 미성년자 <= 20
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '장년', '미성년자', '중년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']